examples/general/example_requesting_only_bal_or_entry_or_both.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:fi:tulli:wsdl_root.002" xmlns:urn1="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" xmlns:urn2="urn:iso:std:iso:20022:tech:xsd:auth.001.001.01" xmlns:urn3="urn:fin.012.001.03">
    <soapenv:Body>
        <urn:ApplicationRequest id="applicationRequest">
            <urn1:AppHdr>
            ...  
            </urn1:AppHdr>
            <urn2:Document>
                <urn2:InfReqOpng>
                    <urn2:InvstgtnId>ABC1234</urn2:InvstgtnId>
                    <urn2:LglMndtBsis>
                        <urn2:Prgrph>testi</urn2:Prgrph>
                    </urn2:LglMndtBsis>
                    <urn2:CnfdtltySts>true</urn2:CnfdtltySts>
                    <urn2:InvstgtnPrd>
                        <urn2:Dt>
                            <urn2:FrDt>2020-09-01</urn2:FrDt>
                            <urn2:ToDt>2024-08-08</urn2:ToDt>
                        </urn2:Dt>
                    </urn2:InvstgtnPrd>
                    <urn2:SchCrit>
                        <urn2:Acct>
                            <urn2:Id>
                                <urn2:Id>
                                    <urn2:IBAN>FI2933891360008653</urn2:IBAN>
                                </urn2:Id>
                            </urn2:Id>
                            <urn2:InvstgtdPties>
                                <urn2:Cd>ALLP</urn2:Cd>
                            </urn2:InvstgtdPties>
                            <urn2:AuthrtyReqTp>
                                <urn2:MsgNmId>camt.053.001.02</urn2:MsgNmId>
                            </urn2:AuthrtyReqTp>
                        </urn2:Acct>
                    </urn2:SchCrit>
                    <urn2:SplmtryData>
                        <urn2:Envlp>
                            <urn3:Document>
                                <urn3:InfReqFin012>
                                    <urn3:RequestedDataSources>
                                        <urn3:DataSourceOrgId>0788060-2</urn3:DataSourceOrgId>
                                    </urn3:RequestedDataSources>
                                    <urn3:InvestigationType>
                                        <urn3:InvestigationTypeCode>BALN</urn3:InvestigationTypeCode>
                                        <urn3:InvestigationTypeCode>TRAN</urn3:InvestigationTypeCode>
                                    </urn3:InvestigationType>
                                </urn3:InfReqFin012>
                            </urn3:Document>
                        </urn2:Envlp>
                    </urn2:SplmtryData>
                </urn2:InfReqOpng>
            </urn2:Document>
        </urn:ApplicationRequest>
    </soapenv:Body>
</soapenv:Envelope>